configuration/src/InformationRegisters/СистемыЗаявокНазначеныеПользователю/СистемыЗаявокНазначеныеПользователю.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СистемыЗаявокНазначеныеПользователю</name>
  <resources>
    <name>ТекущийИсполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкаНаРазработку</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Система</name>
    <type>
      <types>CatalogRef.СистемыУчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/ОчередиЗаявок/ОчередиЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОчередиЗаявок</name>
  <resources>
    <name>Зафиксирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Порядок</name>
    <type>
      <types>DefinedType.ПорядокВОчереди</types>
    </type>
  </resources>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкаНаРазработку</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючОчередиОбъекта</name>
    <type>
      <types>CatalogRef.КлючОчереди</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/ИсторияИзмененийОбъектовПоСобытиям/ИсторияИзмененийОбъектовПоСобытиям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияИзмененийОбъектовПоСобытиям</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Данные</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияСобытия</name>
    <type>
      <types>EnumRef.КатегорииСобытийИсторияИзменений</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DefinedType.ОбъектИсторииИзменений</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерСобытия</name>
    <comment>Хранит номер события в периоде (при изменении объектов может быть несколько записей)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/ОчередьОтправкиЭлектронныхПисем/ОчередьОтправкиЭлектронныхПисем.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОчередьОтправкиЭлектронныхПисем</name>
  <resources>
    <name>Адрес</name>
    <comment>Адрес электронной почты получателя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Важность</name>
    <type>
      <types>EnumRef.ВажностьСообщения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПопыток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>УникальныйИдентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/ОчередьСобытийНаОбработку/ОчередьСобытийНаОбработку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОчередьСобытийНаОбработку</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Данные</name>
    <comment>Данные события в формате JSON</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <comment>Пользователь, инициировавший данное событие</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСобытия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбработки</name>
    <comment>Дата обработки события</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПотока</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Обработано</name>
    <comment>Признак успешной обработки события</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатОбработки</name>
    <comment>Строка с описанием ошибки обработки</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <comment>Объект, к которому относится событие</comment>
    <type>
      <types>CatalogRef.Должности</types>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.Филиалы</types>
      <types>DocumentRef.Спринт</types>
      <types>DocumentRef.ВнутреннееЗадание</types>
      <types>DocumentRef.ВнутренниеТрудозатраты</types>
      <types>DocumentRef.ОбработкаЭскалацииОшибок</types>
      <types>CatalogRef.Продукты</types>
      <types>CatalogRef.Проекты</types>
      <types>CatalogRef.КарточкаКанбан</types>
      <types>CatalogRef.Процессы</types>
      <types>DocumentRef.Задача</types>
      <types>DocumentRef.ЗаявкаНаРазработку</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипСобытия</name>
    <type>
      <types>EnumRef.ТипыСобытийОчереди</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючСобытия</name>
    <comment>Для обеспечения уникальности записей</comment>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/Enums/ВидыОчереди/ВидыОчереди.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОчереди</name>
  <enumValues>
    <name>ГабаритноеПланирование</name>
  </enumValues>
  <enumValues>
    <name>НаправлениеСистема</name>
  </enumValues>
  <enumValues>
    <name>НаправлениеСистемаГруппаЗаказчиков</name>
  </enumValues>
  <enumValues>
    <name>ОчередьВТестировании</name>
  </enumValues>
  <enumValues>
    <name>ОчередьГруппыТестирования</name>
  </enumValues>
  <enumValues>
    <name>Продукт</name>
  </enumValues>
  <enumValues>
    <name>ПродуктСистема</name>
  </enumValues>
  <enumValues>
    <name>Филиал</name>
  </enumValues>
  <enumValues>
    <name>Канбан</name>
  </enumValues>
</mdclass:Enum>

configuration/src/Enums/КатегорииСобытийИсторияИзменений/КатегорииСобытийИсторияИзменений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КатегорииСобытийИсторияИзменений</name>
  <enumValues>
    <name>Главное</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеПорядкаОчереди</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
</mdclass:Enum>

configuration/src/Enums/КатегорииСообщенийПользователя/КатегорииСообщенийПользователя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КатегорииСообщенийПользователя</name>
  <enumValues>
    <name>АвтоматическоеЗакрытиеЗадач</name>
  </enumValues>
  <enumValues>
    <name>ВажныеИзмененияОбъекта</name>
  </enumValues>
  <enumValues>
    <name>ДобавлениеЗадачиВПул</name>
  </enumValues>
  <enumValues>
    <name>ДоступКОбъекту</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеДатВОбъекте</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеЗнанийИВопросов</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеНаправленияОбъекта</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеОписанияИлиНазванияОбъекта</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеПользователейВОбъекте</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеСтатусаОбъекта</name>
  </enumValues>
  <enumValues>
    <name>Комментарии</name>
  </enumValues>
  <enumValues>
    <name>ОповещениеОНаличииСтопСлов</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеИзмененияОбъекта</name>
  </enumValues>
  <enumValues>
    <name>СозданиеОбъектов</name>
  </enumValues>
</mdclass:Enum>

configuration/src/InformationRegisters/СистемыЗаявокНазначеныеПользователю/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Добавляет записи в регистр.
//
// Параметры:
//  Заявка		 - ДокументСсылка.ЗаявкаНаРазработку - ссылка на документ "Заявка на разработку".
//  Система		 - СправочникСсылка.СистемыУчета - ссылка на систему.
//  Филиал		 - СправочникСсылка.Филиалы - ссылка на филиал.
//  Пользователь - СправочникСсылка.Пользователи - ссылка на пользователя.
//  Комментарий	 - Строка - текст комментария для истории и оповещения.
//  
Процедура Добавить(Знач Заявка, Знач Система, Знач Филиал, 
	Знач Пользователь = Неопределено, Знач Комментарий = Неопределено, Знач Данные = "") Экспорт
		
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Заявка.Установить(Заявка);
	НаборЗаписей.Отбор.Система.Установить(Система);
	НаборЗаписей.Отбор.Филиал.Установить(Филиал);
	
	Запись = НаборЗаписей.Добавить();
	Запись.Заявка = Заявка;
	Запись.Система = Система;
	Запись.Филиал = Филиал;
	
	Если Пользователь <> Неопределено Тогда
		Запись.ТекущийИсполнитель = Пользователь;
	КонецЕсли;   
	 
	ДобавлятьВГабаритноеПланирование = ИнтеграцияДополнительныхПодсистем.ДобавлятьЗаявкуВГабаритноеПланирование(Заявка, Филиал);
	
	НачатьТранзакцию();
	Попытка
		НаборЗаписей.Записать(); 
		ЗначениеОчереди = Новый Структура("Филиал", Филиал);
		РегистрыСведений.ОчередиЗаявок.Добавить(Заявка, Перечисления.ВидыОчереди.Филиал, ЗначениеОчереди);
		ОбработатьКомментарий(Заявка, Комментарий, Данные);	 
		
		Если ИнтеграцияДополнительныхПодсистем.СоздаватьИнцидент(Филиал) Тогда
			ДанныеЗадания = Новый Структура;
			ДанныеЗадания.Вставить("Система", Система);
			ДанныеЗадания.Вставить("Филиал", Филиал);
			
			ИнтеграцияДополнительныхПодсистем.ДобавитьЗаданиеСоздатьИнцидентJira(Заявка, ДанныеЗадания);
		КонецЕсли;
		
		Если ДобавлятьВГабаритноеПланирование Тогда 
			РегистрыСведений.ОчередиЗаявок.Добавить(Заявка, Перечисления.ВидыОчереди.ГабаритноеПланирование, ЗначениеОчереди);
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации("СистемыЗаявокНазначенныеПользователю.Добавить", 
			УровеньЖурналаРегистрации.Ошибка, , Заявка, ТекстОшибки);
	КонецПопытки;
	
КонецПроцедуры

// Удаляет записи из регистра о назначенных пользователях по системе заявки
// и добавляет комментарий в историю с оповещением пользователей.
//
// Параметры:
//  Заявка      - ДокументСсылка.ЗаявкаНаРазработку - ссылка на документ "Заявка на разработку".
//  Система		- СправочникСсылка.СистемыУчета - ссылка на систему.
//  Филиал		- СправочникСсылка.Филиалы - ссылка на филиал.
//  Комментарий - Строка - текст комментария для истории и оповещения.
//
Процедура Удалить(Знач Заявка, Знач Система = Неопределено, Знач Филиал = Неопределено, Знач Комментарий = Неопределено, Знач Данные = "") Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Заявка.Установить(Заявка);
	
	Если ЗначениеЗаполнено(Система) Тогда
		НаборЗаписей.Отбор.Система.Установить(Система); 
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Филиал) Тогда
		НаборЗаписей.Отбор.Филиал.Установить(Филиал); 
	КонецЕсли; 
	
	НачатьТранзакцию();
	
	Попытка
		НаборЗаписей.Записать();
		РегистрыСведений.ОчередиЗаявок.Обновить(Заявка, Перечисления.ВидыОчереди.Филиал);	
		ОбработатьКомментарий(Заявка, Комментарий, Данные);
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации("СистемыЗаявокНазначенныеПользователю.Удалить", 
			УровеньЖурналаРегистрации.Ошибка, , Заявка, ТекстОшибки);
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработатьКомментарий(Знач Заявка, Знач Комментарий, Знач Данные = "")

	Если Комментарий <> Неопределено Тогда
		СвойстваСообщения = Новый Структура;
		СвойстваСообщения.Вставить("Данные", Данные);
		СвойстваСообщения.Вставить("Категория", Перечисления.КатегорииСобытийИсторияИзменений.Главное);
		
		РегистрыСведений.ИсторияИзмененийОбъектовПоСобытиям.Добавить(Заявка, СвойстваСообщения);
		
		Если СтрНайти(Комментарий, "</table>") = 0 Тогда
			
			ШаблоныПисьма = РегистрыСведений.ОчередьОтправкиЭлектронныхПисем.ШаблоныЭлектронногоПисьма();
			
			Комментарий = СтрЗаменить(ШаблоныПисьма.БлокДвеТаблицы, "<!-- left_table_1 -->", Комментарий);
			
		КонецЕсли;
		
		СвойстваОповещения = Новый Структура;
		СвойстваОповещения.Вставить("ТекстСообщения", Комментарий);
		СвойстваОповещения.Вставить("КатегорияСообщения", 
			Перечисления.КатегорииСообщенийПользователя.ИзменениеСтатусаОбъекта);
		СвойстваОповещения.Вставить("СообщениеSDMS", " внес(-ла) изменения:");
		СвойстваОповещения.Вставить("Данные", Данные);
		
		РегистрыСведений.ОчередьСобытийНаОбработку.ОтправитьОповещениеОпределяемыеПолучатели(Заявка, СвойстваОповещения);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
	
#КонецЕсли
